# TopographyEditScope Members (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TopographyEditScope Members
TopographyEditScope Class Constructors Methods Properties See Also
---
The TopographyEditScope type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| TopographyEditScope | Instantiates a TopographyEditScope object. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancel | Cancels the edit scope.  (Inherited from EditScope.) |
| Commit | Finishes the edit scope.  (Inherited from EditScope.) |
| Dispose | (Inherited from EditScope.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| Start | Starts a topography surface edit mode for an existing TopographySurface element. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| IsActive | Tells if the EditScope is active. In other words, the EditScope has started but not committed/canceled yet.  (Inherited from EditScope.) |
| IsPermitted | Tells if the edit scope is permitted to start.  (Inherited from EditScope.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from EditScope.) |

# See Also
TopographyEditScope Class
Autodesk.Revit.DB.Architecture Namespace